package com.dreawer.customer;

/**
 * <CODE>ResourceConstants</CODE> 国际化资源常量类。<br/>
 * 该类用于定义“国际化（本地化）资源”的代码规范性常量，以统一工程中有关于对象、属性名称的代码规范。
 * @author David Dai
 * @since Dreawer 2.0
 * @version 1.0
 */


public final class MessageConstants {
    
    /**
     * 私有构造器。
     */
    private MessageConstants() {
    }
    
    // --------------------------------------------------------------------------------
    // 交互信息
    // --------------------------------------------------------------------------------

    /** 交互信息（服务器忙） */
    public static final String MSG_SYSTEM_BUSY = "服务器忙，请稍后再试！";
    
    
    // --------------------------------------------------------------------------------
    // 验证信息
    // --------------------------------------------------------------------------------
    
    /** 验证信息（会员电话号码为空） */
    public static final String VAL_MEMBER_PHONE_NOTEMPTY = "会员电话格式不正确";
    
    /** 验证信息（会员昵称为空） */
    public static final String VAL_MEMBER_NICK_NAME_NOTEMPTY = "用户昵称为1-100字符或1-50汉字组成";
    
    /** 验证信息（会员用户名为空） */
    public static final String VAL_MEMBER_USER_NAME_NOTEMPTY = "会员用户名为1-100字符或1-50汉字组成";
    
    // --------------------------------------------------------------------------------
    // 警告信息
    // --------------------------------------------------------------------------------
    
    
    // --------------------------------------------------------------------------------
    // 错误信息
    // --------------------------------------------------------------------------------
    
    /** 错误信息（其他异常） */
    public static final String ERR_OTHER = "其他错误！";
    
}
